Repository: AYCHIT/Aych-docs-pt-br
Catalog: tutorial/classes.po
Languages: pt_br

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
pt_br: então ``MinhaClasse.i`` e ``MinhaClasse.f`` são referências válidas, que acessam, respectivamente, um inteiro e um objeto função. É possível mudar os valores dos atributos da classe, ou mesmo criar novos atributos, fazendo uma atribuição simples assim: ``MinhaClasse.i = 10``. O nome ``__doc__`` identifica outro atributo válido da classe, referenciando a *docstring* associada à ela: ``"Um exemplo simples de classe"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
pt_br: Para *instanciar* uma classe, usa-se a sintaxe de invocar uma função. Apenas finja que o objeto classe do exemplo é uma função sem parâmetros, que devolve uma nova instância da classe. Continuando o exemplo acima:

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
pt_br: cria uma nova *instância* da classe e atribui o objeto resultante à variável local ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
pt_br: A operação de instanciação ("invocar" um objeto classe) cria um objeto vazio. Muitas classes preferem criar novos objetos com um estado inicial predeterminado. Para tanto, a classe pode definir um método especial chamado :meth:`__init__`, assim::

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly-created class instance. So in this example, a new, initialized instance can be obtained by::
pt_br: Quando uma classe define um método :meth:`__init__`, o processo de instanciação automaticamente invoca :meth:`__init__` sobre a instância recém criada. Em nosso exemplo, uma nova instância já inicializada pode ser obtida desta maneira::

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
pt_br: Naturalmente, o método :meth:`__init__` pode ter parâmetros para maior flexibilidade. Neste caso, os argumentos fornecidos na invocação da classe serão passados para o método :meth:`__init__`. Por exemplo::

source: Instance Objects
pt_br: Objetos de Instância

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names, data attributes and methods.
pt_br: Agora, o que podemos fazer com instâncias? As únicas operações reconhecidas por instâncias são referências a atributos. Existem dois tipos de nomes de atributos válidos: atributos de dados (*data attributes*) e métodos.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
pt_br: Atributos de dados correspondem a "variáveis de instância" em Smalltalk, e a "data members" em C++. Atributos de dados não precisam ser declarados. Assim como variáveis locais, eles passam a existir na primeira vez em que é feita uma atribuição. Por exemplo, se ``x`` é uma instância da :class:`MinhaClasse` criada acima, o próximo trecho de código irá exibir o valor ``16``, sem deixar nenhum rastro na instância (por causa do uso de :keyword:`del`)::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
pt_br: O outro tipo de referências a atributos são métodos. Um método é uma função que "pertence" a uma instância. (Em Python, o termo método não é aplicado exclusivamente a instâncias de classes definidas pelo usuário: outros tipos de objetos também podem ter métodos. Por exemplo, listas possuem os métodos append, insert, remove, sort, etc. Porém, na discussão a seguir usaremos o termo método apenas para se referir a métodos de classes definidas pelo usuário. Seremos explícitos ao falar de outros métodos.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
pt_br: Nomes de métodos válidos de uma instância dependem de sua classe. Por definição, cada atributo de uma classe que é uma função corresponde a um método das instâncias. Em nosso exemplo, ``x.f`` é uma referência de método válida já que ``MinhaClasse.f`` é uma função, enquanto ``x.i`` não é, já que ``MinhaClasse.i`` não é uma função. Entretanto, ``x.f`` não é o mesmo que ``MinhaClasse.f``. A referência ``x.f`` acessa um objeto método (*method object*), e a ``MinhaClasse.f`` acessa um objeto função.

source: Method Objects
pt_br: Objetos de Método

source: Usually, a method is called right after it is bound::
pt_br: Normalmente, um método é invocado imediatamente após ser acessado::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
pt_br: No exemplo :class:`MinhaClasse` o resultado da expressão acima será a string ``'olá, mundo'``. No entanto, não é obrigatório invocar o método imediatamente: como ``x.f`` é também um objeto (um objeto método), ele pode atribuído a uma variável invocado depois. Por exemplo::

source: will continue to print ``hello world`` until the end of time.
pt_br: Esse código exibirá o texto ``'olá, mundo'`` até o mundo acabar.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
pt_br: O que ocorre precisamente quando um método é invocado? Você deve ter notado que ``x.f()`` foi chamado sem nenhum parâmetro, porém a definição da função :meth:`f` especificava um parâmetro. O que aconteceu com esse parâmetro? Certamente Python levanta uma exceção quando uma função que declara um parâmetro é invocada sem nenhum argumento --- mesmo que o argumento não seja usado no corpo da função...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
pt_br: Talvez você já tenha adivinhado a resposta: o que os métodos têm de especial é que eles passam o objeto (ao qual o método está vinculado) como primeiro argumento da função definida na classe. No nosso exemplo, a chamada ``x.f()`` equivale exatamente ``MinhaClasse.f(x)``. Em geral, chamar um método com uma lista de *n* argumentos é equivalente a chamar a função na classe correspondente passando a instância como o primeiro argumento antes dos demais *n* argumentos.

source: Class and Instance Variables
pt_br: Variáveis de Classe e Instância

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
pt_br: De forma geral, variáveis de instância são variáveis que indicam dados que são únicos a cada instância individual, e variáveis de classe são variáveis de atributos e de métodos que são comuns a todas as instâncias de uma classe::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
pt_br: Como vimos em :ref:`tut-object`, o compartilhamento de dados pode causar efeitos inesperados quando envolve objetos mutáveis (em inglês: :term:`mutable` objects), como listas ou dicionários. Por exemplo, a lista *tricks* do código abaixo não deve ser usada como variável de classe, pois assim seria compartilhada por todas as instâncias de *Dog*::

source: Correct design of the class should use an instance variable instead::
pt_br: Em vez disso, o design correto da classe emprega uma variável de instância::

source: Random Remarks
pt_br: Observações Aleatórias

source: Data attributes override method attributes with the same name; to avoid accidental name conflicts, which may cause hard-to-find bugs in large programs, it is wise to use some kind of convention that minimizes the chance of conflicts. Possible conventions include capitalizing method names, prefixing data attribute names with a small unique string (perhaps just an underscore), or using verbs for methods and nouns for data attributes.
pt_br: Atributos de dados sobrescrevem atributos métodos homônimos. Para evitar conflitos de nome acidentais, que podem gerar bugs de difícil rastreio em programas extensos, é sábio adotar algum tipo de convenção que minimize a chance de conflitos. Convenções comuns incluem: definir nomes de métodos com inicial maiúscula, prefixar atributos de dados com uma string única (quem sabe "_" [*underscore* ou sublinhado]), ou usar sempre verbos para nomear métodos e substantivos para atributos de dados.

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
pt_br: Atributos de dados podem ser referenciados por métodos da própria instância, bem como por qualquer outro usuário do objeto (também chamados "clientes" do objeto). Em outras palavras, classes não servem para implementar tipos puramente abstratos de dados. De fato, nada em Python torna possível assegurar o encapsulamento de dados --- tudo é convenção. (Por outro lado, a implementação de Python, escrita em C, pode esconder completamente detalhes de um objeto ou controlar seu acesso, se necessário; isto pode ser utilizado por extensões de Python escritas em C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
pt_br: Clientes devem utilizar atributos de dados com cuidado, pois podem bagunçar invariantes assumidas pelos métodos ao esbarrar em seus atributos de dados. Note que clientes podem adicionar à vontade atributos de dados a uma instância sem afetar a validade dos métodos, desde que seja evitado o conflito de nomes. Novamente, uma convenção de nomenclatura poupa muita dor de cabeça.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
pt_br: Não existe atalho para referenciar atributos de dados (ou outros métodos!) de dentro de um método: sempre é preciso fazer referência explícita ao ``self.`` para acessar qualquer atributo da instância. Em minha opinião isso aumenta a legibilidade dos métodos: não há como confundir uma variável local com um atributo da instância quando lemos rapidamente um método desconhecido.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
pt_br: Frequentemente, o primeiro argumento de um método é chamado ``self``. Isso não passa de uma convenção: o identificador ``self`` não é uma palavra reservada nem possui qualquer significado especial em Python. Mas note que, ao seguir essa convenção, seu código se torna legível por uma grande comunidade de desenvolvedores Python e é possível que alguma *IDE* dependa dessa convenção para analisar seu código.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
pt_br: Qualquer objeto função que é atributo de uma classe, define um método para as instâncias desta classe. Não é necessário que a definição da função esteja textualmente embutida na definição da classe. Atribuir um objeto função a uma variável local da classe é válido. Por exemplo::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
pt_br: Agora ``f``, ``g`` e ``h`` são todos atributos da classe :class:`C` que referenciam funções, e consequentemente são todos métodos de instâncias da classe :class:`C`, onde ``h`` é equivalente a ``g``. No entanto, essa prática serve apenas para confundir o leitor do programa.

source: Methods may call other methods by using method attributes of the ``self`` argument::
pt_br: Métodos podem invocar outros métodos usando atributos de método do argumento ``self`` ::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
pt_br: Métodos podem referenciar nomes globais da mesma forma que funções comuns. O escopo global associado a um método é o módulo contendo sua a definição de sua classe (a classe propriamente dita nunca é usada como escopo global!). Ainda que seja raro justificar o uso de dados globais em um método, há diversos usos legítimos do escopo global. Por exemplo, funções e módulos importados no escopo global podem ser usados por métodos, bem como as funções e classes definidas no próprio escopo global. Provavelmente, a classe contendo o método em questão também foi definida neste escopo global. Na próxima seção veremos razões pelas quais um método pode querer referenciar sua própria classe.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
pt_br: Cada valor é um objeto e, portanto, tem uma *classe* (também chamada de *tipo*). Ela é armazenada como um ``object .__ class__``.

source: Inheritance
pt_br: Herança

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
pt_br: Obviamente, uma característica não seria digna do nome "classe" se não suportasse herança. A sintaxe para uma classe derivada é assim::

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
pt_br: O identificador :class:`NomeClasseBase` deve estar definido no escopo que contém a definição da classe derivada. No lugar do nome da classe base, também são aceitas outras expressões. Isso é muito útil, por exemplo, quando a classe base é definida em outro módulo::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
pt_br: A execução de uma definição de classe derivada procede da mesma forma que a de uma classe base. Quando o objeto classe é construído, a classe base é lembrada. Isso é utilizado para resolver referências a atributos. Se um atributo requisitado não for encontrado na classe, ele é procurado na classe base. Essa regra é aplicada recursivamente se a classe base por sua vez for derivada de outra.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
pt_br: Não há nada de especial sobre instanciação de classes derivadas. ``NomeClasseDerivada()`` cria uma nova instância da classe. Referências a métodos são resolvidas da seguinte forma: o atributo correspondente é procurado através da cadeia de classes base, e referências a métodos são válidas desde se essa procura produza um objeto função.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
pt_br: Classes derivadas podem sobrescrever métodos das suas classes base. Uma vez que métodos não possuem privilégios especiais quando invocam outros métodos no mesmo objeto, um método na classe base que invocava um outro método da mesma classe base, pode efetivamente acabar invocando um método sobreposto por uma classe derivada. (Para programadores C++ isso significa que todos os métodos em Python são realmente virtuais.)

source: Python has two built-in functions that work with inheritance:
pt_br: Python tem duas funções embutidas que trabalham com herança:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
pt_br: * Use :func:`isinstance` para verificar o tipo de uma instância: ``isinstance(obj, int)`` será ``True`` somente se ``obj.__class__`` é a classe :class:`int` ou alguma classe derivada de :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
pt_br: * Use :func:`issubclass` para verificar herança entre classes: ``issubclass(bool, int)`` é ``True`` porque :class:`bool` é uma subclasse de :class:`int`. Entretanto, ``issubclass(unicode, str)`` é ``False`` porque :class:`unicode` não é uma subclasse :class:`str` (essas duas classes derivam da mesma classe base: :class:`basestring`).

source: Multiple Inheritance
pt_br: Herança Múltipla

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
pt_br: Python também suporta uma forma limitada de herança múltipla. Uma definição de classe com várias classes base tem esta forma::

source: Private Variables
pt_br: Variáveis Privadas

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
pt_br: Variáveis instância "privadas", que não podem ser acessados ​​exceto em métodos do próprio objeto não existem em Python. No entanto, existe uma convenção que é seguida pela maioria dos programas em Python: um nome prefixado com um sublinhado (por exemplo: ``_spam`` ) deve ser tratado como uma parte não-pública da API (seja ele uma função, um método ou um atributo de dados). Tais nomes devem ser considerados um detalhe de implementação e sujeito a alteração sem aviso prévio.
