Repository: AYCHIT/Aych-docs-pt-br
Catalog: tutorial/classes.po
Languages: pt_br

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
pt_br: Uma vez que existe um caso de uso válido para a definição de atributos privados em classes (especificamente para evitar conflitos com nomes definidos em subclasses), existe um suporte limitado a identificadores privados em classes, chamado :dfn:`name mangling` (literalmente: desfiguração de nomes). Qualquer identificador no formato ``__spam`` (no mínimo dois underscores ``_`` no prefixo e no máximo um sufixo) é substituído por ``_nomeclasse__spam``, onde ``nomeclasse`` é o nome da classe corrente (exceto quando o nome da classe é prefixado com um ou mais underscores ``_``; nesse caso eles são omitidos). Essa desfiguração independe da posição sintática do identificador, desde que ele apareça dentro da definição de uma classe.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
pt_br: A desfiguração de nomes é útil para que subclasses possam sobrescrever métodos sem quebrar invocações de métodos dentro de outra classe. Por exemplo::

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
pt_br: Note que as regras de desfiguração de nomes foram projetadas para evitar acidentes; ainda é possível acessar e alterar intencionalmente variáveis protegidas por esse mecanismo. De fato isso pode ser útil em certas circunstâncias, por exemplo, durante uma sessão com o :mod:`pdb`, o depurador interativo do Python.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
pt_br: Código passado para ``exec``, ``eval()`` ou ``execfile()`` não considera o nome da classe que invocou como sendo a classe corrente; isso é semelhante ao funcionamento da declaração :keyword:`global`, cujo efeito se aplica somente ao código que é byte-compilado junto. A mesma restrição se aplica as funções ``getattr()``, ``setattr()`` e ``delattr()``, e quando acessamos diretamente o ``__dict__`` da classe: lá as chaves já estão desfiguradas.

source: Odds and Ends
pt_br: Odds e Ends

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
pt_br: Às vezes, é útil ter um tipo semelhante ao "record" de Pascal ou ao "struct" de C, para agrupar alguns itens de dados. Uma definição de classe vazia funciona bem para este fim::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
pt_br: Um trecho de código Python que espera um tipo abstrato de dado em particular, pode receber, ao invés disso, um objeto que emula os métodos que aquele tipo suporta. Por exemplo, se você tem uma função que formata dados obtidos de um objeto arquivo, pode passar como argumento para essa função uma instância de uma classe que implemente os métodos :meth:`read` e :meth:`readline` que obtém os dados lendo um buffer ao invés de ler um arquivo real. (N.d.T. isso é um exemplo de "duck typing" [#]_\ .)

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
pt_br: Objetos método têm seus próprios atributos: ``m.im_self`` é uma referência à instância vinculada ao método :meth:`m`, e ``m.im_func`` é o objeto função (atributo da classe) que corresponde ao método.

source: Iterators
pt_br: Iteradores

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
pt_br: Você já deve ter notado que pode usar laços :keyword:`for` com a maioria das coleções em Python::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
pt_br: Observando o mecanismo por trás do protocolo dos iteradores, fica fácil adicionar esse comportamento às suas classes. Defina uma método :meth:`__iter__` que devolve um objeto que tenha um método :meth:`next`. Se uma classe já define :meth:`next`, então :meth:`__iter__` pode simplesmente devolver ``self``::

source: Generators
pt_br: Geradores

source: :term:`Generator`\s are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
pt_br: Funções geradoras (:term:`generator <generator>`) são uma maneira fácil e poderosa de criar um iterador. Uma função geradora é escrita como uma função normal, mas usa o comando :keyword:`yield` para produzir resultados. (N.d.T. Quando invocada, a função geradora produz um objeto gerador.) Cada vez que :meth:`next` é invocado, o gerador continua a partir de onde parou (ele mantem na memória seus dados internos e a próxima instrução a ser executada). Um exemplo mostra como geradores podem ser muito fáceis de criar::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
pt_br: Qualquer coisa feita com geradores também pode ser feita com iteradores baseados numa classe, como descrito na seção anterior. O que torna geradores tão compactos é que os métodos :meth:`__iter__` e :meth:`next` são criados automaticamente.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
pt_br: Outro ponto chave é que as variáveis locais e o estado da execução são preservados automaticamente entre as chamadas de :meth:`next`. Isto torna a função mais fácil de escrever e muito mais clara do que uma implementação usando variáveis de instância como ``self.index`` e ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
pt_br: Além disso, quando geradores terminam, eles levantam :exc:`StopIteration` automaticamente. Combinados, todos estes aspectos tornam a criação de iteradores tão fácil quanto escrever uma função normal.

source: Generator Expressions
pt_br: Expressões GeradorAS

source: Examples::
pt_br: Exemplos::

source: Footnotes
pt_br: Notas de Rodapé

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
pt_br: Exceto por uma coisa. Os objetos de módulo têm um atributo secreto e de somente leitura chamado :attr:`~objeto.__ dict__` que retorna o dicionário usado para implementar o namespace do módulo; O nome :attr:`~objeto.__dict__` é um atributo, mas não um nome global. Obviamente, usar isso viola a abstração da implementação do namespace, e deve ser restrito a coisas como depuradores post-mortem.
