Repository: AYCHIT/Aych-docs-pt-br
Catalog: sphinx.po
Languages: pt_br

source: This Page
pt_br: Está Página

source: Report a Bug
pt_br: Relate um Bug

source: Show Source
pt_br: Exibe Código Fonte

source: CPython implementation detail:
pt_br: Detalhes da implementação do CPython:

source: Welcome! This is the documentation for Python %(release)s.
pt_br: Bem-vindo! Esta é a documentação do Python %(release)s.

source: Parts of the documentation:
pt_br: Partes da documentação:

source: What's new in Python %(version)s?
pt_br: O que temos de novo no Python %(version)s?

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
pt_br: ou <a href="%(whatsnew_index)s">tudo "O que temos de novo" documentos</a> desde a 2.0

source: start here
pt_br: Comece por aqui

source: Library Reference
pt_br: Referência de Bibliotecas

source: keep this under your pillow
pt_br: mantenha isso debaixo do seu travesseiro

source: Language Reference
pt_br: Referência da Linguagem

source: describes syntax and language elements
pt_br: descrição da sintaxe e dos elementos da linguagem

source: Python Setup and Usage
pt_br: Configuraçoẽs e Uso do Python

source: how to use Python on different platforms
pt_br: como usar o Python em diferentes plataformas

source: in-depth documents on specific topics
pt_br: documentos aprofundados sobre tópicos específicos

source: Installing Python Modules
pt_br: Instalando Módulos Python

source: installing from the Python Package Index &amp; other sources
pt_br: Instalando a partir do Python Package Index & e outras fontes

source: Distributing Python Modules
pt_br: Distribuindo Módulos Python

source: publishing modules for installation by others
pt_br: módulos publicados para instalação por outros

source: Extending and Embedding
pt_br: Estendendo e Incorporando

source: tutorial for C/C++ programmers
pt_br: tutorial para programadores C/C++

source: reference for C/C++ programmers
pt_br: referência para programadores C/C++

source: frequently asked questions (with answers!)
pt_br: Perguntas freqüentes (com respostas!)

source: Indices and tables:
pt_br: Índices e Tabelas:

source: Global Module Index
pt_br: Índice de Módulos Globais

source: quick access to all modules
pt_br: acesso rápido a todos os módulos

source: General Index
pt_br: Índice geral

source: all functions, classes, terms
pt_br: todas as funções, classes, termos

source: Glossary
pt_br: Glossário

source: the most important terms explained
pt_br: os termos mais importantes explicados

source: Search page
pt_br: Página de Pesquisa

source: search this documentation
pt_br: busque nesta documentação

source: Complete Table of Contents
pt_br: Conteúdo completo

source: lists all sections and subsections
pt_br: lista de todas as seções e subsecções

source: Reporting bugs
pt_br: Relatando erros

source: About the documentation
pt_br: Sobre a Documentação

source: History and License of Python
pt_br: História e Licença do Python

source: Download these documents
pt_br: Download desses documentos

source: Python 2.7 (stable)
pt_br: Python 2.7 (estável)

source: Other resources
pt_br: Outros recursos

source: PEP Index
pt_br: Índice das PEP

source: Beginner's Guide
pt_br: Guia do iniciante

source: Book List
pt_br: Lista de Livros

source: Audio/Visual Talks
pt_br: Conversas Audiovisuais

source: Documentation
pt_br: Documentação

source: Quick search
pt_br: Busca Rápida

source: The Python Software Foundation is a non-profit corporation.
pt_br: O Python Software Foundation é uma corporação sem fins lucrativos.

source: Please donate.
pt_br: Por favor, doe.

source: Last updated on %(last_updated)s.
pt_br: Últimos atualização em %(last_updated)s.

source: <a href="%(pathto_bugs)s">Found a bug</a>?
pt_br: <a href="%(pathto_bugs)s">encontrou um bug</a>?

source: Created using <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.
pt_br: Criado usando o <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.
